using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

/*
 * Шахматы
 *    
 *  1. Шахматная доска
 *    - полей[]
 *    
 *  2. Поле шахматной доски
 *    - цвет
 *    - координаты
 *    - фигура
 *    
 *  3. Фигура поля шахматной доски
 *    - тип фигуры
 *    - цвет фигуры
 *    
 *  3.1. Конь - фигура (наследник)
 *  3.2. Пешка - фигура (наследник)
 *  
 *  
 *  
 *  Книга рецептов
 *  
 *  1. Книга рецептов
 *   - рецепты (массив)
 *   - владелец
 *   
 *  2. Рецепт
 *   - название
 *   - ингриденты (массив)
 *   - описание
 *   
 *  3. Ингридиенты
 *    - название
 *    - цвет
 *   
 *   3.1. Жидкий ингридиент (наследний от ингридиента)
 *    - плотность
 *    - объем
 *    
 *   3.2. Сыпучий ингридиент (наследний от ингридиента)
 *    - масса
 *    
 *    
 *    
 */


namespace pi182_20190925_classes.Chess
{
  class ChessBoard
  {
  }
}
